IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_MDLXBAR_CONTROLSS_MDLXBAR.xml
<module name="CONTROLSS_MDLXBAR_CONTROLSS_MDLXBAR" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CONTROLSS_MDLXBAR_PID" acronym="CONTROLSS_MDLXBAR_PID" offset="0x0" width="32" description="">
		<bitfield id="PID_MSB16" width="16" begin="31" end="16" resetval="0x24960" description="Not Defined" range="31 - 16" rwaccess="RO"/> 
		<bitfield id="PID_MISC" width="5" begin="15" end="11" resetval="0x0" description="Not Defined" range="15 - 11" rwaccess="RO"/> 
		<bitfield id="PID_MAJOR" width="3" begin="10" end="8" resetval="0x2" description="Not Defined" range="10 - 8" rwaccess="RO"/> 
		<bitfield id="PID_CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Not Defined" range="7 - 6" rwaccess="RO"/> 
		<bitfield id="PID_MINOR" width="6" begin="5" end="0" resetval="0x20" description="Not Defined" range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR0_G0" acronym="CONTROLSS_MDLXBAR_MDLXBAR0_G0" offset="0x100" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar0 G0 input bit select. Input source is PWMA sclk select1: PWMA sclk bit[x] selected0: PWMA sclk bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR0_G1" acronym="CONTROLSS_MDLXBAR_MDLXBAR0_G1" offset="0x104" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar0 G1 input bit select. Input source is PWMB sclk select1: PWMB sclk bit[x] selected0: PWMB sclk bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR0_G2" acronym="CONTROLSS_MDLXBAR_MDLXBAR0_G2" offset="0x108" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar0 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311: ICSS_PORT[y].GPO[x] selected.0: ICSS_PORT[y].GPO[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR1_G0" acronym="CONTROLSS_MDLXBAR_MDLXBAR1_G0" offset="0x140" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar1 G0 input bit select. Input source is PWMA sclk select1: PWMA sclk bit[x] selected0: PWMA sclk bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR1_G1" acronym="CONTROLSS_MDLXBAR_MDLXBAR1_G1" offset="0x144" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar1 G1 input bit select. Input source is PWMB sclk select1: PWMB sclk bit[x] selected0: PWMB sclk bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR1_G2" acronym="CONTROLSS_MDLXBAR_MDLXBAR1_G2" offset="0x148" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar1 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311: ICSS_PORT[y].GPO[x] selected.0: ICSS_PORT[y].GPO[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR2_G0" acronym="CONTROLSS_MDLXBAR_MDLXBAR2_G0" offset="0x180" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar2 G0 input bit select. Input source is PWMA sclk select1: PWMA sclk bit[x] selected0: PWMA sclk bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR2_G1" acronym="CONTROLSS_MDLXBAR_MDLXBAR2_G1" offset="0x184" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar2 G1 input bit select. Input source is PWMB sclk select1: PWMB sclk bit[x] selected0: PWMB sclk bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR2_G2" acronym="CONTROLSS_MDLXBAR_MDLXBAR2_G2" offset="0x188" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar2 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311: ICSS_PORT[y].GPO[x] selected.0: ICSS_PORT[y].GPO[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR3_G0" acronym="CONTROLSS_MDLXBAR_MDLXBAR3_G0" offset="0x1C0" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar3 G0 input bit select. Input source is PWMA sclk select1: PWMA sclk bit[x] selected0: PWMA sclk bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR3_G1" acronym="CONTROLSS_MDLXBAR_MDLXBAR3_G1" offset="0x1C4" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar3 G1 input bit select. Input source is PWMB sclk select1: PWMB sclk bit[x] selected0: PWMB sclk bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR3_G2" acronym="CONTROLSS_MDLXBAR_MDLXBAR3_G2" offset="0x1C8" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar3 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311: ICSS_PORT[y].GPO[x] selected.0: ICSS_PORT[y].GPO[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR4_G0" acronym="CONTROLSS_MDLXBAR_MDLXBAR4_G0" offset="0x200" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar4 G0 input bit select. Input source is PWMA sclk select1: PWMA sclk bit[x] selected0: PWMA sclk bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR4_G1" acronym="CONTROLSS_MDLXBAR_MDLXBAR4_G1" offset="0x204" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar4 G1 input bit select. Input source is PWMB sclk select1: PWMB sclk bit[x] selected0: PWMB sclk bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR4_G2" acronym="CONTROLSS_MDLXBAR_MDLXBAR4_G2" offset="0x208" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar4 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311: ICSS_PORT[y].GPO[x] selected.0: ICSS_PORT[y].GPO[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR5_G0" acronym="CONTROLSS_MDLXBAR_MDLXBAR5_G0" offset="0x240" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar5 G0 input bit select. Input source is PWMA sclk select1: PWMA sclk bit[x] selected0: PWMA sclk bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR5_G1" acronym="CONTROLSS_MDLXBAR_MDLXBAR5_G1" offset="0x244" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar5 G1 input bit select. Input source is PWMB sclk select1: PWMB sclk bit[x] selected0: PWMB sclk bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR5_G2" acronym="CONTROLSS_MDLXBAR_MDLXBAR5_G2" offset="0x248" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar5 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311: ICSS_PORT[y].GPO[x] selected.0: ICSS_PORT[y].GPO[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR6_G0" acronym="CONTROLSS_MDLXBAR_MDLXBAR6_G0" offset="0x280" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar6 G0 input bit select. Input source is PWMA sclk select1: PWMA sclk bit[x] selected0: PWMA sclk bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR6_G1" acronym="CONTROLSS_MDLXBAR_MDLXBAR6_G1" offset="0x284" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar6 G1 input bit select. Input source is PWMB sclk select1: PWMB sclk bit[x] selected0: PWMB sclk bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR6_G2" acronym="CONTROLSS_MDLXBAR_MDLXBAR6_G2" offset="0x288" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar6 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311: ICSS_PORT[y].GPO[x] selected.0: ICSS_PORT[y].GPO[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR7_G0" acronym="CONTROLSS_MDLXBAR_MDLXBAR7_G0" offset="0x2C0" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar7 G0 input bit select. Input source is PWMA sclk select1: PWMA sclk bit[x] selected0: PWMA sclk bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR7_G1" acronym="CONTROLSS_MDLXBAR_MDLXBAR7_G1" offset="0x2C4" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar7 G1 input bit select. Input source is PWMB sclk select1: PWMB sclk bit[x] selected0: PWMB sclk bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR7_G2" acronym="CONTROLSS_MDLXBAR_MDLXBAR7_G2" offset="0x2C8" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar7 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311: ICSS_PORT[y].GPO[x] selected.0: ICSS_PORT[y].GPO[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR8_G0" acronym="CONTROLSS_MDLXBAR_MDLXBAR8_G0" offset="0x300" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar8 G0 input bit select. Input source is PWMA sclk select1: PWMA sclk bit[x] selected0: PWMA sclk bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR8_G1" acronym="CONTROLSS_MDLXBAR_MDLXBAR8_G1" offset="0x304" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar8 G1 input bit select. Input source is PWMB sclk select1: PWMB sclk bit[x] selected0: PWMB sclk bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR8_G2" acronym="CONTROLSS_MDLXBAR_MDLXBAR8_G2" offset="0x308" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar8 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311: ICSS_PORT[y].GPO[x] selected.0: ICSS_PORT[y].GPO[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR9_G0" acronym="CONTROLSS_MDLXBAR_MDLXBAR9_G0" offset="0x340" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar9 G0 input bit select. Input source is PWMA sclk select1: PWMA sclk bit[x] selected0: PWMA sclk bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR9_G1" acronym="CONTROLSS_MDLXBAR_MDLXBAR9_G1" offset="0x344" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar9 G1 input bit select. Input source is PWMB sclk select1: PWMB sclk bit[x] selected0: PWMB sclk bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR9_G2" acronym="CONTROLSS_MDLXBAR_MDLXBAR9_G2" offset="0x348" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar9 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311: ICSS_PORT[y].GPO[x] selected.0: ICSS_PORT[y].GPO[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR10_G0" acronym="CONTROLSS_MDLXBAR_MDLXBAR10_G0" offset="0x380" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar10 G0 input bit select. Input source is PWMA sclk select1: PWMA sclk bit[x] selected0: PWMA sclk bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR10_G1" acronym="CONTROLSS_MDLXBAR_MDLXBAR10_G1" offset="0x384" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar10 G1 input bit select. Input source is PWMB sclk select1: PWMB sclk bit[x] selected0: PWMB sclk bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR10_G2" acronym="CONTROLSS_MDLXBAR_MDLXBAR10_G2" offset="0x388" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar10 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311: ICSS_PORT[y].GPO[x] selected.0: ICSS_PORT[y].GPO[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR11_G0" acronym="CONTROLSS_MDLXBAR_MDLXBAR11_G0" offset="0x3C0" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar11 G0 input bit select. Input source is PWMA sclk select1: PWMA sclk bit[x] selected0: PWMA sclk bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR11_G1" acronym="CONTROLSS_MDLXBAR_MDLXBAR11_G1" offset="0x3C4" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar11 G1 input bit select. Input source is PWMB sclk select1: PWMB sclk bit[x] selected0: PWMB sclk bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR11_G2" acronym="CONTROLSS_MDLXBAR_MDLXBAR11_G2" offset="0x3C8" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar11 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311: ICSS_PORT[y].GPO[x] selected.0: ICSS_PORT[y].GPO[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR12_G0" acronym="CONTROLSS_MDLXBAR_MDLXBAR12_G0" offset="0x400" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar12 G0 input bit select. Input source is PWMA sclk select1: PWMA sclk bit[x] selected0: PWMA sclk bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR12_G1" acronym="CONTROLSS_MDLXBAR_MDLXBAR12_G1" offset="0x404" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar12 G1 input bit select. Input source is PWMB sclk select1: PWMB sclk bit[x] selected0: PWMB sclk bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR12_G2" acronym="CONTROLSS_MDLXBAR_MDLXBAR12_G2" offset="0x408" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar12 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311: ICSS_PORT[y].GPO[x] selected.0: ICSS_PORT[y].GPO[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR13_G0" acronym="CONTROLSS_MDLXBAR_MDLXBAR13_G0" offset="0x440" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar13 G0 input bit select. Input source is PWMA sclk select1: PWMA sclk bit[x] selected0: PWMA sclk bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR13_G1" acronym="CONTROLSS_MDLXBAR_MDLXBAR13_G1" offset="0x444" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar13 G1 input bit select. Input source is PWMB sclk select1: PWMB sclk bit[x] selected0: PWMB sclk bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR13_G2" acronym="CONTROLSS_MDLXBAR_MDLXBAR13_G2" offset="0x448" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar13 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311: ICSS_PORT[y].GPO[x] selected.0: ICSS_PORT[y].GPO[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR14_G0" acronym="CONTROLSS_MDLXBAR_MDLXBAR14_G0" offset="0x480" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar14 G0 input bit select. Input source is PWMA sclk select1: PWMA sclk bit[x] selected0: PWMA sclk bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR14_G1" acronym="CONTROLSS_MDLXBAR_MDLXBAR14_G1" offset="0x484" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar14 G1 input bit select. Input source is PWMB sclk select1: PWMB sclk bit[x] selected0: PWMB sclk bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR14_G2" acronym="CONTROLSS_MDLXBAR_MDLXBAR14_G2" offset="0x488" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar14 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311: ICSS_PORT[y].GPO[x] selected.0: ICSS_PORT[y].GPO[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR15_G0" acronym="CONTROLSS_MDLXBAR_MDLXBAR15_G0" offset="0x4C0" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar15 G0 input bit select. Input source is PWMA sclk select1: PWMA sclk bit[x] selected0: PWMA sclk bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR15_G1" acronym="CONTROLSS_MDLXBAR_MDLXBAR15_G1" offset="0x4C4" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar15 G1 input bit select. Input source is PWMB sclk select1: PWMB sclk bit[x] selected0: PWMB sclk bit[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_MDLXBAR_MDLXBAR15_G2" acronym="CONTROLSS_MDLXBAR_MDLXBAR15_G2" offset="0x4C8" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="MDL XBar15 G2 input bit select. Input source is ICSS GPO selecty=0 when x =0 to 15, y=1 when x=16 to 311: ICSS_PORT[y].GPO[x] selected.0: ICSS_PORT[y].GPO[x] is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
</module>